<!DOCTYPE HTML>
<HTML>
	<HEAD>
            <META charset="UTF-8" />
            <TITLE>PortFolio - Lo&iuml;c DERRIEUX</TITLE>
            <LINK type="text/css" rel="stylesheet" href="./css/main.css" />
            <SCRIPT type="text/javascript" src="./script/ext/jquery.js"></script>
            <SCRIPT type="text/javascript" src="./script/scroll2.js"></script>
            <SCRIPT type="text/javascript" src="./script/main.js"></script>
		
	</HEAD>
	<BODY>
	<div id="voile">
		<div id ="container">
			<header>
				<h1>portfolio</h1>
				<h2>Lo&eacute;c DERRIEUX</h2>
			</header>
			<nav>
				<div><a onclick="show(0);">News</a></div>
				<div><a onclick="show(1);">Experience</a></div>
				<div><a onclick="show(2);">Formation</a></div>
				<div><a onclick="show(3);">Projets</a></div>
				<div><a onclick="show(4);">Qui-suis-je</a></div>
				<div><a onclick="show(5);">Contacts</a></div>
			</nav>
			<section>				
				<h3>News</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">						
						<article>
							<h4>15 mai 2016</h4>
                                                        <p>Apr&eacute;s un mois de formation, nous pouvons dire que les apprenants sont toujours aussi motiv&eacute;s &eacute;</p>
							<p>Nous avons effectu&eacute; une prise en main des outils nous permettant de developper sur le web :</p>
								<ul>
									<li>Architecture syst&eacute;me et r&eacute;seaux</li>
									<li>Mod&eacute;le Client/Serveur</li>
									<li>Prise en main d'un syst&eacute;me UNIX</li>
									<li>Structuration de l'information : HTML</li>
									<li>Design et ergonomie de l'interface utilisateur : CSS</li>
									<li>Experience utilisateur avanc&eacute;e : Javascript</li>
								</ul>
							
						</article>
						<article>
							<h4>04 avril 2016</h4>
							<p>D&eacute;but de la formation de developpeur web juniors en collaboration avec Fondespierre RH et Simplon.co</p>
							<p>Le groupe est aussi motiv&eacute; que le jour des selections, les ages et les skills de base sont homog&eacute;nes. </p>
						</article>
					</div>
				</div>
			</section>
			<section >
				<h3>Experience</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">
						<article>
							<p>1 mois pass&eacute; a former des developpeurs junior web front</p>
							<p></p>
						</article>
					</div>
				</div>
			</section>
			<section >
				<h3>Formation</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">
						<article>
							<p>1 mois pass&eacute; a former des developpeurs junior web front</p>
							<p></p>
						</article>
					</div>
				</div>
			</section>
			<section >
				<h3>Projets</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">
						<article>
							<h4>CRM - BTP</h4>
							<p>Developpement d'un CRM &eacute; destination des artisans du BTP. En collaboration avec R&eacute;mi Foulier pour le compte de batitel, version 0.9 : hybride JavaSE et JavaEE</p>
                                                        <p>Actuellement, Nous en sommes sur une architecture MVVC : </p>
								<ul>
									<li>persistence mise en place avec hibernate</li>
									<li>base de donn&eacute;e embarqu&eacute;e HyperSQL</li>
									<li>bases de donn&eacute;es distantes (gestion clientele : postGreSQL - gestion des composants : MySQL)</li>
									<li>la vue est control&eacute;e par l'environnement graphique JavaFX - avec en cours de dev : annotations pour le databinding</li>
								</ul>
							
							
						</article>
						<article>
							<h4>PLATEFORME DE PARTAGE DE PROJETS - DREAM FROM</h4>
							<p>Dans mon esprit depuis ma premiere page web, en 1999, j'ai pofit&eacute; de la formation en JavaEE pour prendre un vps chez amazon et faire mes premiers tests <a href="http://dream-from.fr">ici</a></p>
							<p>Le concept : Pour beaucoup, la phase de cr&eacute;ation de projet est tr&eacute;s productive, mais les al&eacute;as em&eacute;nent souvent &eacute; l'avortement. En partageant avc les autres utilisateurs, certains peuvent ressortir les projets poussi&eacute;reux et leur redonner un coup de boost...</p>
						</article>
					</div>
				</div>
			</section>
			<section >
				<h3>Qui-suis-je</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">
						<article>
							<h4>Gen&eacute;ration Y</h4>
							<p>Nourri aux jeux de roles cyberpunk et heroic fantasy, avoir v&eacute;cu dans cet espace-temps m'a permis d'apprecier le partage des connaissances pour ce qu'elle est : Un partage des connaissances.</p>
							<p>Vid&eacute;os de chats et photos de famille ne sont cens&eacute; se retrouver sur des reseaux sociaux administr&eacute;s par les utilisateurs. J'attache une importance capitale a une utilisation de l'outil informatique qui permet d'etre acteur de l'information. A la difference de la t&eacute;l&eacute;vision o&eacute; la tendance est a la passivit&eacute;</p>
						</article>
						<article>
							<h4>Heterog&eacute;ne</h4>
							<p>Mes rencontres m'ont apport&eacute;es un r&eacute;seaux heterog&eacute;ne, me permettant de pouvoir toucher du doigt la majorit&eacute; des domaines que l'esprit humain &eacute; pu concevoir</p>
							<p>J'avoue avoir eu une affinit&eacute; particuli&eacute;re avec la musique, qui me permet, dans l'absolu, de pouvoir sortir des m&eacute;lodies de n'importe quel instrument... si ce n'est la pratique. J'ai beaucoup pratiqu&eacute; la guitare et la basse - actuellement je bosse le picking sur du blues </p>
							<p>Mon petit plaisir, c'est d'avoir l'oportunit&eacute; de suivre les cours de richard taillet sur youtube. J'ai pu reprendre quelques cours de math ;) </p>
						</article>
					</div>
				</div>
			</section>
			<section >
				<h3>Contacts</h3>
				<div class="viewport">
					<div class="scroll"></div>
					<div class="content">
						<article>
							<p>1 mois pass&eacute; a former des developpeurs junior web front</p>
							<p></p>
						</article>
					</div>
				</div>
			</section>
		</div>
		</div>
	</BODY>
</HTML>